app/controllers/restaurants_controller.rb

    def destroy
        restaurant = find_restaurant
        restaurant.destroy
---
DELETE FROM "restaurants" WHERE "restaurants"."id" = ?  [["id", 1]]

    def find_restaurant
        Restaurant.find(params[:id])
---
SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]